aaron-bond.better-comments
amazonwebservices.codewhisperer-for-command-line-companion
anthropic.claude-code
anysphere.cursorpyright
anysphere.pyright
arturock.gitstash
biomejs.biome
bmewburn.vscode-intelephense-client
christian-kohler.path-intellisense
cschlosser.doxdocgen
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
eighthundreds.vscode-drawio
equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.codespaces
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
hashicorp.terraform
humao.rest-client
inferrinizzard.prettier-sql-vscode
jeff-hykin.better-cpp-syntax
josetr.cmake-language-support-vscode
keyhr.42-c-format
kiteco.kite
kube.42header
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-speech
ms-vscode.vscode-websearchforcopilot
ms-vsliveshare.vsliveshare
nomicfoundation.hardhat-solidity
oderwat.indent-rainbow
openai.chatgpt
pkief.material-icon-theme
qwtel.sqlite-viewer
ritwickdey.liveserver
rust-lang.rust-analyzer
rvest.vs-code-prettier-eslint
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
tauri-apps.tauri-vscode
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vitest.explorer
vue.volar
wix.vscode-import-cost
yzhang.markdown-all-in-one
